//=============================================================================
//
// サウンド処理 [sound.h]
// Author : GP11A132 08 王麒皓 
// 
//=============================================================================
#pragma once

#include <windows.h>
#include "xaudio2.h"						// サウンド処理で必要

//*****************************************************************************
// サウンドファイル
//*****************************************************************************
enum 
{
	SOUND_LABEL_BGM_title,	// BGM0
	SOUND_LABEL_BGM_field,	// BGM2
	SOUND_LABEL_SE_shoot,		// 爆発音

	SOUND_LABEL_MAX,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
bool InitSound(HWND hWnd);
void UninitSound(void);
void PlaySound(int label);
void StopSound(int label);
void StopSound(void);

